app/controllers/admin/users_controller.rb

  def index
    @users = User.unscoped.paginate(:page => params[:page], :per_page => 30)
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 10 OFFSET 0

  def show
    @user = User.unscoped.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 33 LIMIT 1

  def edit
    @user = User.unscoped.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 33 LIMIT 1

  def update
    password_presence
    @user = User.unscoped.find(params[:id])
    @user.save!(:validate => false)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 33 LIMIT 1
UPDATE `users` SET `external_user_id` = 644106691, `address` = '', `provider` = '', `updated_at` = '2013-03-11 19:31:59' WHERE `users`.`id` = 33