app/controllers/home_controller.rb

  def update_address
    if params[:changed] == '1'
      if current_user
        current_resource.update_attributes(params[:user])
---
UPDATE `users` SET `lat` = 53.3926005, `updated_at` = '2013-03-06 00:27:08', `city` = 'Baldoyle', `lng` = -6.127215500000034, `address` = '22 Moyclare Road, Baldoyle, Ireland' WHERE `users`.`id` = 11