app/controllers/reviews_controller.rb

  def create
    @review = Review.create((params[:review] || {}).merge(:user_id => current_resource.id))
---
INSERT INTO `reviews` (`address`, `author_id`, `comment`, `created_at`, `lat`, `lng`, `name`, `phone`, `repost_from`, `updated_at`, `user_id`, `visible`) VALUES ('', 2, 'She is very kind and friendly. Very relaxing. John and Kevin really trust her.She is very kind and friendly. Very relaxing. John and Kevin really trust her.She is very kind and friendly. Very relaxing. John and Kevin really trust her.She is very kind and friendly. Very relaxing. John and Kevin really trust her.She is very kind and friendly. Very relaxing. John and Kevin really trust her.She is very kind and friendly. Very relaxing. John and Kevin really trust her.She is very kind and friendly. Very relaxing. John and Kevin really trust her.', '2013-03-11 21:39:20', NULL, NULL, 'Shile', '', NULL, '2013-03-11 21:39:20', 2, 1)

  def show
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 ORDER BY reviews.created_at DESC LIMIT 1

  def edit
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 ORDER BY reviews.created_at DESC LIMIT 1

  def update
    @review = Review.find(params[:id])
    if @review.update_attributes(params[:review])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 3 ORDER BY reviews.created_at DESC LIMIT 1
UPDATE `reviews` SET `comment` = 'A strapping young lad, and reliable.', `updated_at` = '2013-03-11 22:01:58' WHERE `reviews`.`id` = 3