app/controllers/users_controller.rb

  def show
    param = params[:id] || params[:slug]
    @resource = User.unscoped.find_by_slug(param)
    if @resource == current_resource
      @review = Review.new
      @reviews_count = @resource.reviews_count
      @users_in_area_count = User.with_entries.in_area(current_resource).count
---
SELECT COUNT(*) FROM `users` WHERE (external_user_id IN (NULL) OR id IN (NULL))